<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"8a70688ab378b68a2cfd39dc2e28d633c60487c0b6de12af500f5158a56db465","plan_job_ref":"Job Test plan target and replace #351 at https://github.com/dflook/terraform-github-actions/actions/runs/5563632276","plan_hash":"597a959e0ab1b8cd4cadaaecd82e22855322823e1209736a78a10e91729174cf","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "IjRn968whi" -> (known after apply)
  ~ foreach = "NVNLsaeucf" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #351](https://github.com/dflook/terraform-github-actions/actions/runs/5563632276)